package by.htp.hometask.cycles.tasks;

public class Task4 {

    //. С помощью оператора while напишите программу вывода всех четных чисел в диапазоне
    //от 2 до 100 включительно.

    public static void main(String arg[]) {

        int i = 1;

        while (i <= 99) {
            i++;
            System.out.println(i);
        }
    }
}
